Revit 2024 API
SymbolTypeId.Kcal Property
 Symbol kcal, indicating unit Kilocalories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId Kcal { get; }
Visual Basic
Public Shared ReadOnly Property Kcal As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Kcal {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace